# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### Load Required Libraries

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (9.1.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

### Connect to DB using Mysql-connector-python package

In [6]:
import mysql.connector

# Create a connection to MySQL
conn = mysql.connector.connect(
    host="localhost",   # Change this to your MySQL host
    user="root",        # Change this to your MySQL username
    password="password" # Change this to your MySQL password
)

cursor = conn.cursor()

### You are required to create a database named 'e_commerce'

In [7]:
# Create a new database called 'e_commerce'
cursor.execute("CREATE DATABASE IF NOT EXISTS e_commerce")
cursor.execute("USE e_commerce")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [8]:
# Create supplier table
cursor.execute("""
    CREATE TABLE IF NOT EXISTS supplier (
        SUPP_ID INT PRIMARY KEY,
        SUPP_NAME VARCHAR(50),
        SUPP_CITY VARCHAR(50),
        SUPP_PHONE VARCHAR(10)
    )
""")

# Create customer table
cursor.execute("""
    CREATE TABLE IF NOT EXISTS customer (
        CUS_ID INT PRIMARY KEY,
        CUS_NAME VARCHAR(20),
        CUS_PHONE VARCHAR(10),
        CUS_CITY VARCHAR(30),
        CUS_GENDER CHAR
    )
""")

# Create category table
cursor.execute("""
    CREATE TABLE IF NOT EXISTS category (
        CAT_ID INT PRIMARY KEY,
        CAT_NAME VARCHAR(20)
    )
""")

# Create product table
cursor.execute("""
    CREATE TABLE IF NOT EXISTS product (
        PRO_ID INT PRIMARY KEY,
        PRO_NAME VARCHAR(20),
        PRO_DESC VARCHAR(60),
        CAT_ID INT,
        FOREIGN KEY (CAT_ID) REFERENCES category (CAT_ID)
    )
""")

# Create product_details table
cursor.execute("""
    CREATE TABLE IF NOT EXISTS product_details (
        PROD_ID INT PRIMARY KEY,
        PRO_ID INT,
        SUPP_ID INT,
        PROD_PRICE INT,
        FOREIGN KEY (PRO_ID) REFERENCES product(PRO_ID),
        FOREIGN KEY (SUPP_ID) REFERENCES supplier(SUPP_ID)
    )
""")

# Create orders table
cursor.execute("""
    CREATE TABLE IF NOT EXISTS orders (
        ORD_ID INT PRIMARY KEY,
        ORD_AMOUNT INT,
        ORD_DATE DATE,
        CUS_ID INT,
        PROD_ID INT,
        FOREIGN KEY (CUS_ID) REFERENCES customer(CUS_ID),
        FOREIGN KEY (PROD_ID) REFERENCES product_details(PROD_ID)
    )
""")

# Create rating table
cursor.execute("""
    CREATE TABLE IF NOT EXISTS rating (
        RAT_ID INT PRIMARY KEY,
        CUS_ID INT,
        SUPP_ID INT,
        RAT_RATSTARS INT,
        FOREIGN KEY (SUPP_ID) REFERENCES supplier(SUPP_ID),
        FOREIGN KEY (CUS_ID) REFERENCES customer(CUS_ID)
    )
""")

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- |
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 |
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [9]:
# Insert data into supplier table
cursor.execute("""
    INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE)
    VALUES (1, 'Rajesh Retails', 'Delhi', '1234567890'),
           (2, 'Appario Ltd.', 'Mumbai', '2589631470'),
           (3, 'Knome products', 'Bangalore', '9785462315'),
           (4, 'Bansal Retails', 'Kochi', '8975463285'),
           (5, 'Mittal Ltd.', 'Lucknow', '7898456532')
""")

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [10]:
# Insert data into customer table
cursor.execute("""
    INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER)
    VALUES (1, 'AAKASH', '9999999999', 'DELHI', 'M'),
           (2, 'AMAN', '9785463215', 'NOIDA', 'M'),
           (3, 'NEHA', '9999999998', 'MUMBAI', 'F'),
           (4, 'MEGHA', '9994562399', 'KOLKATA', 'F'),
           (5, 'PULKIT', '7895999999', 'LUCKNOW', 'M')
""")

#### Table:  category
| CAT_ID | CAT_NAME |
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES |
| 4 | ELECTRONICS |
| 5 | CLOTHES |

In [11]:
# Insert data into category table
cursor.execute("""
    INSERT INTO category (CAT_ID, CAT_NAME)
    VALUES (1, 'BOOKS'),
           (2, 'GAMES'),
           (3, 'GROCERIES'),
           (4, 'ELECTRONICS'),
           (5, 'CLOTHES')
""")

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- |
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 |
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [12]:
# Insert data into product table
cursor.execute("""
    INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID)
    VALUES (1, 'GTA V', 'DFJDJFDFJDFDJFJF', 2),
           (2, 'TSHIRT', 'DFJDJFDFJDFDJFDK', 5),
           (3, 'ROG LAPTOP', 'ROG GAMING LAPTOP', 4),
           (4, 'OATS', 'HEALTHY OATS', 3),
           (5, 'HARRY POTTER', 'BOOK BY JK ROWLING', 1)
""")

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- |
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 |
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [13]:
# Insert data into product_details table
cursor.execute("""
    INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE)
    VALUES (1, 1, 1, 1500),
           (2, 2, 2, 500),
           (3, 3, 3, 70000),
           (4, 4, 4, 100),
           (5, 5, 5, 1200)
""")

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [14]:
# Insert data into orders table
cursor.execute("""
    INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID)
    VALUES (1, 1, '2023-01-10', 1, 1),
           (2, 1, '2023-02-12', 2, 2),
           (3, 1, '2023-03-05', 3, 3),
           (4, 1, '2023-04-10', 4, 4),
           (5, 1, '2023-05-15', 5, 5)
""")

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- |
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 |
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [15]:
# Insert data into rating table
cursor.execute("""
    INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS)
    VALUES (1, 1, 1, 4),
           (2, 2, 2, 5),
           (3, 3, 3, 3),
           (4, 4, 4, 4),
           (5, 5, 5, 5)
""")

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [16]:
cursor.execute("SELECT * FROM orders WHERE ORD_AMOUNT >= 3000")
orders_check = cursor.fetchall()
print("Orders with amount >= 3000:", orders_check)

Orders with amount >= 3000: []

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [17]:
cursor.execute("""
    SELECT DISTINCT customer.CUS_ID, customer.CUS_NAME, customer.CUS_GENDER, orders.ORD_AMOUNT
    FROM customer
    JOIN orders ON customer.CUS_ID = orders.CUS_ID
""")
customer_orders_check = cursor.fetchall()
print("Customers and their orders:", customer_orders_check)

Customers and their orders: [(1, 'AAKASH', 'M', 1), (2, 'AMAN', 'M', 1), (3, 'NEHA', 'F', 1), (4, 'MEGHA', 'F', 1), (5, 'PULKIT', 'M', 1)]

### Q5) Display the Supplier details who can supply more than one product.

In [26]:
# Query to find suppliers who supply more than one product
cursor.execute("""
    SELECT supplier.SUPP_ID, supplier.SUPP_NAME, supplier.SUPP_PHONE
    FROM supplier
    JOIN product_details ON supplier.SUPP_ID = product_details.SUPP_ID
    GROUP BY supplier.SUPP_ID, supplier.SUPP_NAME, supplier.SUPP_PHONE
    HAVING COUNT(DISTINCT product_details.PRO_ID) > 1
""")
suppliers_with_multiple_products = cursor.fetchall()
print("Suppliers with more than one product:", suppliers_with_multiple_products)

Suppliers with more than one product: []

### Q6) Find the category of the product whose order amount is minimum.

In [31]:
# Query to find the category of the product with the minimum order amount
cursor.execute("""
    SELECT category.CAT_ID, category.CAT_NAME
    FROM orders
    JOIN product_details ON orders.PROD_ID = product_details.PRO_ID
    JOIN product ON product_details.PRO_ID = product.PRO_ID
    JOIN category ON product.CAT_ID = category.CAT_ID
    WHERE orders.ORD_AMOUNT = (
        SELECT MIN(ORD_AMOUNT) FROM orders
    )
""")
category_of_min_order = cursor.fetchall()
print("Category of the product with the minimum order amount:", category_of_min_order)

Category of the product with the minimum order amount: [(2, 'GAMES'), (5, 'CLOTHES'), (4, 'ELECTRONICS'), (3, 'GROCERIES'), (1, 'BOOKS')]

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [32]:
# Query to get the ID and name of products ordered after "2021-10-05"
cursor.execute("""
    SELECT product.PRO_ID, product.PRO_NAME
    FROM orders
    JOIN product_details ON orders.PROD_ID = product_details.PRO_ID
    JOIN product ON product_details.PRO_ID = product.PRO_ID
    WHERE orders.ORD_DATE > '2021-10-05'
""")
products_after_date = cursor.fetchall()
print("Products ordered after '2021-10-05':", products_after_date)

Products ordered after '2021-10-05': [(1, 'GTA V'), (2, 'TSHIRT'), (3, 'ROG LAPTOP'), (4, 'OATS'), (5, 'HARRY POTTER')]

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [42]:
# Query to get the top 3 suppliers based on their rating along with customer names
cursor.execute("""
    SELECT supplier.SUPP_ID, supplier.SUPP_NAME, rating.RAT_RATSTARS, customer.CUS_NAME
    FROM supplier
    JOIN rating ON supplier.SUPP_ID = rating.SUPP_ID
    JOIN customer ON rating.CUS_ID = customer.CUS_ID
    ORDER BY rating.RAT_RATSTARS DESC
    LIMIT 3
""")
top_suppliers = cursor.fetchall()

# Printing the results
print("Top 3 Suppliers based on rating:")
for supplier in top_suppliers:
    print(f"Supplier ID: {supplier[0]}, Name: {supplier[1]}, Rating: {supplier[2]}, Customer: {supplier[3]}")

Top 3 Suppliers based on rating:
Supplier ID: 2, Name: Appario Ltd., Rating: 5, Customer: AMAN
Supplier ID: 5, Name: Mittal Ltd., Rating: 5, Customer: PULKIT
Supplier ID: 1, Name: Rajesh Retails, Rating: 4, Customer: AAKASH

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [43]:
# Query to find customer names and genders starting or ending with 'A'
cursor.execute("""
    SELECT CUS_NAME, CUS_GENDER
    FROM customer
    WHERE CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A'
""")
customers_with_A = cursor.fetchall()

# Printing the results
print("Customers whose names start or end with 'A':")
for customer in customers_with_A:
    print(f"Name: {customer[0]}, Gender: {customer[1]}")

Customers whose names start or end with 'A':
Name: AAKASH, Gender: M
Name: AMAN, Gender: M
Name: NEHA, Gender: F
Name: MEGHA, Gender: F

### Q10) Display the total order amount of the male customers.

In [44]:
# Query to get the total order amount of male customers
cursor.execute("""
    SELECT SUM(o.ORD_AMOUNT) AS Total_Order_Amount
    FROM orders o
    JOIN customer c ON o.CUS_ID = c.CUS_ID
    WHERE c.CUS_GENDER = 'M'
""")
total_amount = cursor.fetchone()[0]  # Fetching the result

# Printing the result
print(f"Total order amount of male customers: {total_amount if total_amount is not None else 0}")

Total order amount of male customers: 3

### Q11) Display all the Customers left outer join with  the orders

In [45]:
# Query to get all customers with left outer join on orders
cursor.execute("""
    SELECT c.CUS_ID, c.CUS_NAME, c.CUS_GENDER, o.ORD_ID, o.ORD_AMOUNT
    FROM customer c
    LEFT JOIN orders o ON c.CUS_ID = o.CUS_ID
""")
customers_with_orders = cursor.fetchall()  # Fetching all results

# Printing the result
for customer in customers_with_orders:
    print(customer)

(1, 'AAKASH', 'M', 1, 1)
(2, 'AMAN', 'M', 2, 1)
(3, 'NEHA', 'F', 3, 1)
(4, 'MEGHA', 'F', 4, 1)
(5, 'PULKIT', 'M', 5, 1)

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)